---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.BendingDetailTypeMultipleValuesIndicatorOptions.FromOneBar
enum: Autodesk.Revit.DB.Structure.BendingDetailTypeMultipleValuesIndicatorOptions
source: html/4c1439fb-dbbf-97c2-4160-587bdd875535.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailTypeMultipleValuesIndicatorOptions.FromOneBar

Obtain parameter value from only one bar.